Revit 2027 API
ParameterTypeId.BoundaryRestraintRotY Property
 "Y Rotation Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryRestraintRotY { get; }
Public Shared ReadOnly Property BoundaryRestraintRotY As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryRestraintRotY {
	ForgeTypeId^ get ();
}
static member BoundaryRestraintRotY : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace